# Автоотключение 3D-принтера при бездействии

При наличии модуля управления питанием BTT Relay, подключенного по методике [ссылка], возможно
реализовать автоотключение принтера по бездействию. Такое автоотключение повышает безопасность использования 3D-принтера,
а также позволяет обойти проблему нежелательного автовключения реле BTT при начальной подаче питания 220В.

В файл Printer.cfg добавляются 3 секциии:

Макрос выключения принтера. Запрос для Moonraker на выполнение команды ```shutdown - h now```, планово завершающую работу системы, 
останавливающую ядро Linux, и снимающую сигнал удержания с модуля BTT Relay (см. методику)

```gcode
[gcode_macro SHUTDOWN_MACHINE]

gcode:
    {action_call_remote_method("shutdown_machine")}
```

G-код, выполняемый по бездействию клиппера (в данном примере - 3600 секунд, или 1 час).
Выключаются нагреватели (если включены), моторы, и вызывается макрос выключения принтера.

```gcode
[idle_timeout]
timeout: 3600
gcode:
#  M117 "Idle timeout"
   TURN_OFF_HEATERS
   M84
   SHUTDOWN_MACHINE
```

G-код, выполняемый сразу после старта клиппера. Необходим для запуска таймера бездействия.
```gcode
[delayed_gcode touch_idle_timeout]
gcode:
  M117 "Hello!"
initial_duration: 1
```

